In [1]:
import pandas as pd

In [11]:
# List of Tuples
students = [('jack', 34, 'Sydeny'),
            ('Riti', 30, 'Delhi'),
            ('Aadi', 16, 'New York'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Mumbai'),
            ('Aadi', 40, 'London'),
            ('Sachin', 30, 'Delhi')
            ]
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])

In [12]:
df

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   City    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [14]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [15]:
df[df.duplicated()]

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

In [21]:
df.duplicated(subset=['Name'])

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7    False
dtype: bool

In [16]:
df_1 = df.drop_duplicates()

In [17]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 192.0+ bytes

In [18]:
df_1

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [19]:
df_2 = df.drop_duplicates(ignore_index = True)
df_2

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30    Mumbai
4    Aadi   40    London
5  Sachin   30     Delhi

In [20]:
df_3 = df.drop_duplicates(subset=['Name'], ignore_index = True)
df_3

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3  Sachin   30     Delhi